Ewalk02/fishduino/sdkconfig.defaults.common
#
# AquaPilot shared defaults (all hardware targets)
#

CONFIG_IDF_TARGET="esp32p4"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

CONFIG_SPIRAM=y

CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ESP-Hosted Wi-Fi (ESP32-C6 coprocessor over SDIO via esp_wifi_remote)
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=64

CONFIG_LWIP_SNTP_MAX_SERVERS=1

# Fluval hosted BLE (NimBLE central on P4 host, controller on onboard ESP32-C6 via ESP-Hosted VHCI)
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_TRANSPORT_UART=n
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y
CONFIG_ESP_HOSTED_NIMBLE_HCI_VHCI=y

CONFIG_FISHDUINO_FLUVAL_DEFAULT_TRANSPORT_HOSTED_BLE=y

# ESP32-P4 v1.x board support (Waveshare P4 boards report rev v1.3)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP32P4_REV_MIN_FULL=100
CONFIG_ESP_REV_MIN_FULL=100
CONFIG_ESP32P4_REV_MAX_FULL=199
CONFIG_ESP_REV_MAX_FULL=199

# app_main may run BSP display start + full LVGL UI tree build synchronously
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288

# Cockpit dashboard typography
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
